# Prot_GetSeatsNum

## Description
Returns the number of Vectorworks seats licensed on the server.

```pascal
FUNCTION Prot_GetSeatsNum : INTEGER;
```

```python
def vs.Prot_GetSeatsNum():
    return INTEGER
```

## Version
Availability: from Vectorworks 2015

## Category
* Protection